fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

#КонецОбласти       

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новая дата проведения работ: %1.", Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"));
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)

	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новое время начала проведения работ: %1.", Объект.ВремяНачалаРабот);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новое время окончания проведения работ: %1.", Объект.ВремяОкончанияРабот);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Назначен новый специалист: %1.", Объект.Специалист);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьвСправочникИзменения(ТекстСообщения)
	
	НовыйЭлементСправ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовыйЭлементСправ.ТекстСообщения = ТекстСообщения;
	НовыйЭлементСправ.Записать();
	
КонецПроцедуры 

#КонецОбласти
